org/blog/2021/2021-24.org
#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org
#+TITLE: 2021 年第 24 周总结

抵挡诱惑，说起来容易，做起来难。

看完 B 站 Up 主稚晖君 6 月 6
日的一期视频「[[https://www.bilibili.com/video/BV1fV411x72a][【自制】我把自行车做成了
自 动 驾 驶
！！【硬核】]]」。无比感叹，看到他把一个想法实现到这种程度，我问自己：如果你有一个点子，你愿意为这个点子，付出多少努力，甚至如稚晖君这般做出成品？

视频中涉及到的科技知识，先前已经有所积累，而后再厚积薄发，慢慢形成「自行车自动驾驶」的想法，进而开始着手实施。

在这一过程中，需要哪些要素：

1. 偶然的一次受伤，使稚晖君产生了「制造一辆自动驾驶自行车」的想法
2. 此前知识的储备

喜欢一样事物是需要磨合的，你经过尝试和行动，发现做某件事情的时候会面临很多困难和挑战，恰好你的能力足以应对这些挑战，你并不排斥应对这些挑战的过程，并能从中获得正向反馈。

关于如何认知自我，处理自我和父母之间的关系。

将一个任务，分解成小步骤，每完成一个步骤就能给自己带来一次积极的反馈，从而而使自己拥有完成这些小步骤的动力。

身心健康对我很重要，主要可以通过锻炼、社交，以及良好的作息（睡眠、饮食）做到。

工作的意义在于人的最高需求------自我实现。

对于「知识付费」的态度不重要，重要的是怎样利用它来提升自己。

Yak Shaving: 发现问题；解决问题；点到为止；完善项目
