blog/2021/2021-24.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 22:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2021 年第 24 周总结</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">2021 年第 24 周总结</h1>
</header><p>
抵挡诱惑，说起来容易，做起来难。
</p>

<p>
看完 B 站 Up 主稚晖君 6 月 6
日的一期视频「<a href="https://www.bilibili.com/video/BV1fV411x72a">【自制】我把自行车做成了
自 动 驾 驶
！！【硬核】</a>」。无比感叹，看到他把一个想法实现到这种程度，我问自己：如果你有一个点子，你愿意为这个点子，付出多少努力，甚至如稚晖君这般做出成品？
</p>

<p>
视频中涉及到的科技知识，先前已经有所积累，而后再厚积薄发，慢慢形成「自行车自动驾驶」的想法，进而开始着手实施。
</p>

<p>
在这一过程中，需要哪些要素：
</p>

<ol class="org-ol">
<li>偶然的一次受伤，使稚晖君产生了「制造一辆自动驾驶自行车」的想法</li>
<li>此前知识的储备</li>
</ol>

<p>
喜欢一样事物是需要磨合的，你经过尝试和行动，发现做某件事情的时候会面临很多困难和挑战，恰好你的能力足以应对这些挑战，你并不排斥应对这些挑战的过程，并能从中获得正向反馈。
</p>

<p>
关于如何认知自我，处理自我和父母之间的关系。
</p>

<p>
将一个任务，分解成小步骤，每完成一个步骤就能给自己带来一次积极的反馈，从而而使自己拥有完成这些小步骤的动力。
</p>

<p>
身心健康对我很重要，主要可以通过锻炼、社交，以及良好的作息（睡眠、饮食）做到。
</p>

<p>
工作的意义在于人的最高需求-&#x2013;&#x2014;自我实现。
</p>

<p>
对于「知识付费」的态度不重要，重要的是怎样利用它来提升自己。
</p>

<p>
Yak Shaving: 发现问题；解决问题；点到为止；完善项目
</p>
</div>
</body>
</html>